In [31]:
import pandas as pd
user_item_details=pd.read_csv("./Datasets/movie_ratings.csv")
user_item_details

        user_id  movie_id  rating
0             0        50       5
1             0       172       5
2             0       133       1
3           196       242       3
4           186       302       3
...         ...       ...     ...
99998       880       476       3
99999       716       204       5
100000      276      1090       1
100001       13       225       2
100002       12       203       3

[100003 rows x 3 columns]

In [32]:
import pandas as pd
movie_details=pd.read_csv("./Datasets/movie_titles.csv")
movie_details.head(10)

   movie_id                                              title
0         1                                   Toy Story (1995)
1         2                                   GoldenEye (1995)
2         3                                  Four Rooms (1995)
3         4                                  Get Shorty (1995)
4         5                                     Copycat (1995)
5         6  Shanghai Triad (Yao a yao yao dao waipo qiao) ...
6         7                              Twelve Monkeys (1995)
7         8                                        Babe (1995)
8         9                            Dead Man Walking (1995)
9        10                                 Richard III (1995)

In [33]:
# merge the two datasets
data=pd.merge(user_item_details,movie_details,on='movie_id')
data.head(10)

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)
5      274        50       5  Star Wars (1977)
6      227        50       4  Star Wars (1977)
7       99        50       5  Star Wars (1977)
8      305        50       5  Star Wars (1977)
9      108        50       4  Star Wars (1977)

In [34]:
data['movie_id'].sort_values(ascending=True)

4785        1
4574        1
4573        1
4572        1
4571        1
         ...
99961    1678
99941    1679
99968    1680
99987    1681
99997    1682
Name: movie_id, Length: 100003, dtype: int64

In [35]:
# best rated movies
data.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [36]:
# get the number of rating per movie
mean_ratings=pd.DataFrame(data.groupby('title')['rating'].mean())
mean_ratings
mean_ratings['numb_of_ratings']=pd.DataFrame(data.groupby('title') ['rating'].count())
mean_ratings.head(10)

                                               rating  numb_of_ratings
title
'Til There Was You (1997)                    2.333333                9
1-900 (1994)                                 2.600000                5
101 Dalmatians (1996)                        2.908257              109
12 Angry Men (1957)                          4.344000              125
187 (1997)                                   3.024390               41
2 Days in the Valley (1996)                  3.225806               93
20,000 Leagues Under the Sea (1954)          3.500000               72
2001: A Space Odyssey (1968)                 3.969112              259
3 Ninjas: High Noon At Mega Mountain (1998)  1.000000                5
39 Steps, The (1935)                         4.050847               59

In [41]:
mean_ratings.groupby('title')['numb_of_ratings'].mean().sort_values(ascending=False).head(10)

title
Star Wars (1977)                 584.0
Contact (1997)                   509.0
Fargo (1996)                     508.0
Return of the Jedi (1983)        507.0
Liar Liar (1997)                 485.0
English Patient, The (1996)      481.0
Scream (1996)                    478.0
Toy Story (1995)                 452.0
Air Force One (1997)             431.0
Independence Day (ID4) (1996)    429.0
Name: numb_of_ratings, dtype: float64